code-review/NRB_3471_3546/База_Было/Documents/ПогашениеЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПогашениеЦБ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦБ</xr:Item>
				<xr:Item>AccumulationRegister.ЦБВПути</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Депонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦБ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепоМестаХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепоМестаХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЦБ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЦБ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ВидыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОтчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпискаОСостоянииСчетаДЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОбОперацияхПоСчетуДЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводныйОтчетОСовершеннойОперации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/Выписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Выписка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СлужебноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.иц_СводноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МХВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МХУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияЦБ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеОтчетаВыписки</v8:Type>
						<v8:Type>cfg:DocumentRef.ГлобальнаяОперация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЦБВПути</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеНКД</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеквизитовСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеАнкетныхДанных</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацииЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБПолное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБЧастичное</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеРеестраВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПоручения</v8:Type>
						<v8:Type>cfg:DocumentRef.УчастиеВКД</v8:Type>
						<v8:Type>cfg:DocumentRef.КонвертацияЦБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭмитентВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭмитентУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтправкиОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыПередачиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияВыпискиОперационныйДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИнформация</Name>
					<Comment>Произвольный текст для вывода в соответствующее поля отчета о совершенной операции</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбновлятьДопИнформацию</Name>
					<Comment>Если требуется заблокировать автоматичсекое обновление поля, то следует установить этот флаг.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ПогашениеЦБ/Ext/ObjectModule.bsl
Перем УслугаОперации;
Перем Тариф;

// Проверка на существование документа созданного на основании
// переданного через параметр.
//
// Параметры
//  Основание  – Документ.Поручение
//                 
// Возвращаемое значение:
//   Булево.Истина   – если уже есть докумнт созданный на переданном основании.
//
Функция ПроверкаНаСозданныеДокументыНаОснованииТекущего(Основание)
	ДокументСозданныйНаОсновании = Документы.ПогашениеЦБ.НайтиПоРеквизиту("ДокументОснование", Основание);
	
	Возврат Ссылка <> ДокументСозданныйНаОсновании И НЕ ДокументСозданныйНаОсновании.Пустая();
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Процедура СформироватьВыпискиПоПогашениюЦБ()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПогашениеЦБЦенныеБумаги.Депонент	КАК Депонент,
	|	ПогашениеЦБЦенныеБумаги.Количество	КАК Остаток,
	|	Выписка.Ссылка КАК ВыпискаСсылка,
	|	ПогашениеЦБЦенныеБумаги.СчетДепо КАК СчетДепо,
	|	ПогашениеЦБЦенныеБумаги.СчетДепо.Владелец КАК СчетДепоВладелец
	|ИЗ
	|	Документ.ПогашениеЦБ.ЦенныеБумаги КАК ПогашениеЦБЦенныеБумаги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Выписка КАК Выписка
	|		ПО ПогашениеЦБЦенныеБумаги.Депонент = Выписка.СчетДепо.Владелец
	|			И ПогашениеЦБЦенныеБумаги.Ссылка = Выписка.ОперацияЦБ
	|ГДЕ
	|	ПогашениеЦБЦенныеБумаги.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ВыпискаСсылка) Тогда
			ВыпискаОбъект = Выборка.ВыпискаСсылка.ПолучитьОбъект();
		Иначе
			ВыпискаОбъект = Документы.Выписка.СоздатьДокумент();
		КонецЕсли;
		
		Если ВыпискаОбъект.ПометкаУдаления Тогда
			ВыпискаОбъект.ПометкаУдаления = Ложь;
			ВыпискаОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;	
		
		ВыпискаОбъект.ОперацияЦБ = Ссылка;
		ВыпискаОбъект.Дата = Дата;
		ВыпискаОбъект.ВидОтчета = Перечисления.ВидыОтчетов.Отчет;
		ВыпискаОбъект.ДокументОснование = ДокументОснование;
		ВыпискаОбъект.СчетДепо = Выборка.СчетДепо;
		ВыпискаОбъект.ВладелецСчета = Выборка.СчетДепоВладелец;
		ВыпискаОбъект.ПометкаУдаления = Ложь;
		ВыпискаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьЗапросПоРегиструОстаткиЦБ()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ОстаткиЦБОстатки.СчетДепо,
	|	ОстаткиЦБОстатки.РазделСчетаДепо,
	|	ОстаткиЦБОстатки.СчетДепоМХ,
	|	ОстаткиЦБОстатки.РазделСчетаДепоМХ,
	|	ОстаткиЦБОстатки.ЦБ,
	|	ОстаткиЦБОстатки.СтатусЦБ,
	|	ОстаткиЦБОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(&выбДата, ЦБ = &выбЦБ) КАК ОстаткиЦБОстатки";
	
	Запрос.УстановитьПараметр("выбДата", Дата);
	Запрос.УстановитьПараметр("выбЦБ", ЦБ);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции

Функция СформироватьЗапросПоРегиструЦБВПути()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦБВПутиОстатки.СчетДепо КАК СчетДепо,
	|	ЦБВПутиОстатки.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ЦБВПутиОстатки.СчетДепоМХ КАК СчетДепоМХ,
	|	ЦБВПутиОстатки.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	ЦБВПутиОстатки.ЦБ КАК ЦБ,
	|	ЦБВПутиОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ЦБВПути.Остатки(&выбДата, ЦБ = &выбЦБ) КАК ЦБВПутиОстатки";
	
	Запрос.УстановитьПараметр("выбДата", Дата);
	Запрос.УстановитьПараметр("выбЦБ", ЦБ);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                  - выборка из результата запроса по шапке документа.
//	ВыборкаПоРаботники					     - выборка из результата запроса ТЧ "Работники".									
//  СтруктураПроведенияПоРегистрамНакопления - структура, содержащая имена регистров 
//                                             накопления по которым надо проводить документ
//  СтруктураПараметров                      - структура параметров проведения.
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамНакопления(текДвижения, табЦБ, флДелатьДвиженияПоРегиструУслуг)
	
	Для Каждого СтрокаЦБ Из табЦБ Цикл
		
		Движение = текДвижения.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.СчетДепо = СтрокаЦБ.СчетДепо;
		Движение.РазделСчетаДепо = СтрокаЦБ.РазделСчетаДепо;
		Движение.ЦБ = СтрокаЦБ.ЦБ;
		Движение.СчетДепоМХ = СтрокаЦБ.СчетДепоМХ;
		Движение.РазделСчетаДепоМХ = СтрокаЦБ.РазделСчетаДепоМХ;
		
		Если текДвижения = Движения.ОстаткиЦБ Тогда
			
			Движение.СтатусЦБ = СтрокаЦБ.СтатусЦБ;
			
		КонецЕсли;
		
		Движение.Количество = СтрокаЦБ.КоличествоОстаток;
		
		Если флДелатьДвиженияПоРегиструУслуг Тогда
			
			ДепозитарийКлиент.СоздатьДвиженияДокумента(Дата,Движения,СтрокаЦБ.СчетДепо.Владелец,УслугаОперации,Тариф);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	табОстаткиЦБ = СформироватьЗапросПоРегиструОстаткиЦБ();
	табЦБВПути   = СформироватьЗапросПоРегиструЦБВПути();
	
	Если табОстаткиЦБ.Количество() = 0 И табЦБВПути.Количество() Тогда
		Сообщить("Указанных ценных бумаг нет ни на одном из счетов депо.");
		Отказ = Истина;
	КонецЕсли;
	
	флУслуги = Ложь;
	
	Если НЕ Отказ Тогда
		ДобавитьСтрокуВДвиженияПоРегистрамНакопления(Движения.ОстаткиЦБ, табОстаткиЦБ, флУслуги);
		ДобавитьСтрокуВДвиженияПоРегистрамНакопления(Движения.ЦБВПути, табЦБВПути, флУслуги);
	КонецЕсли;
	
	СформироватьВыпискиПоПогашениюЦБ();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(ЦБ) Тогда
		
		Сообщить("Не выбрана ценная бумаги");  
		Отказ = Истина;			
		
	КонецЕсли;	
	
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(Инициатор) Тогда
		
		Сообщить("Не выбран эмитент");  
		Отказ = Истина;			
		
	КонецЕсли;	
	
	УстановитьНовыйНомер();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание) Экспорт
	Если Основание = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ПроверкаНаСозданныеДокументыНаОснованииТекущего(Основание) Тогда
		Проверка = Истина;
		Сообщить("На основании данного поручения уже есть введенный документ!!!");
		Возврат;
	КонецЕсли;
	
	Если Основание.ВидОперацииД = Справочники.ВидыОпераций.Погашение
		ИЛИ Основание.ВидОперацииД = Справочники.ВидыОпераций.СписаниеАкцийПриЛиквидацииЭмитента
		ИЛИ Основание.ВидОперацииД = Справочники.ВидыОпераций.СписаниеОбесценившихсяЦенныхБумаг
		Тогда 
		Инициатор = Основание.Инициатор;
		ДокументОснование = Основание.Ссылка;			
		Комментарий = Строка(Основание);
		ЦБ = Основание.ЦБ;
		Дата = ОбщегоНазначения.ДатаДокумента(Основание);
		ЦенныеБумаги.Очистить();
		Для каждого СтрокаТаблицы Из Основание.ЦенныеБумагиСписываемые Цикл
			НоваяСтрока = ЦенныеБумаги.Добавить();
			НоваяСтрока.СчетДепо						= СтрокаТаблицы.СчетДепо;
			НоваяСтрока.Депонент						= СтрокаТаблицы.СчетДепо.Владелец;
			НоваяСтрока.РазделСчетаДепо					= СтрокаТаблицы.РазделСчетаДепо;
			НоваяСтрока.СчетДепоМестаХранения			= СтрокаТаблицы.СчетДепоМХ;
			НоваяСтрока.РазделСчетаДепоМестаХранения	= СтрокаТаблицы.РазделСчетаДепоМХ;
			НоваяСтрока.Количество						= СтрокаТаблицы.Количество;
		КонецЦикла;
	Иначе
		Проверка			= Истина;
		ДокументОснование 	= Документы.Поручение.ПустаяСсылка();			
		Сообщить("На основании данного вида поручения нельзя создать документ ""Погашение ценных бумаг"". 
				|Вид операции должен быть ""Погашение ЦБ"", ""Списание акций при ликвидации эмитента"""
				+ " или ""Списание обесценившихся ценных бумаг""!");
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Если Проверка Тогда
		Возврат;
	КонецЕсли;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры
